SOMETHING_WENT_WRONG = "🤖 Что-то пошло не так... Попробуйте позже"
AUTHORIZATION_ERROR = "🤖 Произошла ошибка авторизации. Попробуйте зайти позже"
REGISTRATION_ERROR = "🤖 Произошла ошибка регистрации. Попробуйте зайти позже"

START_COMMAND = "start"
HELLO_ANSWER = "🎉 <b>Welcome!</b>"
START_ANSWER = "📚 <b>Что ты можешь делать здесь:</b>\n"\
               "🔹 Найти свою группу\n"\
               "🔹 Присоединиться к ней\n"\
               "🔹 Включить и получать уведомления о парах\n"\
               "🔹 Смотреть расписание любой другой группы\n\n"\
               "<b>Воспользуйся меню навигации</b> 👇"

HELP_COMMAND = "help"
HELP_ANSWER = "📚 <b>Как пользоваться ботом:</b>\n"\
              "🔹 Найти свою группу\n"\
              "🔹 Присоединиться к ней\n"\
              "🔹 Включить и получать уведомления о парах\n"\
              "🔹 Смотреть расписание любой другой группы\n\n"\
              "‼️ Не забудь включить уведомления в ТГ 😉"

SUPPORT_COMMAND = "support"
SUPPORT_ANSWER = "🤖 <i>В случае возникновения проблем или появления идей по моему улучшению, "\
                  "можешь обращаться к моим создателям</i> ⤵️\n\n"\
                 "@MMAFC, @zimeoww, @tclutin, @a_bezm"

FEEDBACK_COMMAND = "feedback"
FEEDBACK_ANSWER = "Пожалуйста, заполни небольшую анкету обратной связи. "\
                  "Твое мнение очень важно для меня и моих создателей 🤗\n\n"\
                  "https://forms.gle/cSMLUNV8CPjhkGqX7"

NEW_UPDATE = "🎉 <b>Недавно меня обновили!</b>\n\n"\
             "💥 <b>Что нового:</b>\n"\
             "🔹 Авторизация стала проще и удобнее\n"\
             "🔹 Теперь нужную группу можно найти быстрее, т. к. они отсортированы\n"\
             "🔹 Переписана логика выбора расписания\n"\
             "🔹 Исправлено расписание у группы ПИ-101\n\n"\
             f"{SUPPORT_ANSWER}"

STUDENT_LOGGED_IN = "🤖 Рад снова видеть тебя здесь!"

CHOOSE_FACULTY = "Выбери нужный факультет"
CHOOSE_PROGRAM = "Выбери программу обучения"
CHOOSE_GROUP = "Выбери нужную группу"

FACULTIES_ARE_EMPTY = "👨‍💻 Факультеты здесь скоро появятся"
PROGRAMS_ARE_EMPTY = "👨‍💻 Программы здесь скоро появятся"

NOTIFICATIONS_WARNING = "⚠️ <i>Уведомления будут приходить, только если вступить в группу</i>"

IN_DEVELOPING = "В разработке... 👨‍💻"

SOMETHING_WITH_MY_MEMORY = "Ой, что-то случилось с моей памятью 😵‍💫\n"\
                           "Давай начнем сначала"

GROUPS_WILL_BE_HERE_SOON = "Группы здесь скоро появятся..."
NOW_YOU_CAN_VIEW_SCHEDULE = "Теперь с помощью кнопок ниже ты можешь смотреть расписание "\
                                          "или вступить в группу"
YOU_JOINED_SUCCESSFUL = "Теперь ты участник группы! 🥳"
YOUR_GROUPS = "Вот группы, в которых ты состоишь:\n\n"
YOU_CAN_FIND_GROUP_AGAIN = "Ты можешь заново найти нужную тебе группу"
YOU_LEAVED_SUCCESSFUL = "Теперь ты не состоишь в этой группе 🫠"
YOU_ARE_ALREADY_JOINED = "Ты уже состоишь в этой группе!"

CHOOSE_SCHEDULE_TYPE = "Выбери вариант расписания ⤵"
SCHEDULE_NO_EXISTS = "Староста еще не загрузил расписание 😪\n"\
                     "Попробуй поторопить его"

NOW_FIRST_WEEK = "<b>I неделя</b>\n\n"
NOW_SECOND_WEEK = "<b>II неделя</b>\n\n"
TODAY_NO_SUBJECTS = "Сегодня пар нет 🥳"

MONDAY = "<b>🟩🟩🟩 Понедельник 🟩🟩🟩</b>"
TUESDAY = "<b>🟩🟩🟩 Вторник 🟩🟩🟩</b>"
WEDNESDAY = "<b>🟩🟩🟩 Среда 🟩🟩🟩</b>"
THURSDAY = "<b>🟩🟩🟩 Четверг 🟩🟩🟩</b>"
FRIDAY = "<b>🟩🟩🟩 Пятница 🟩🟩🟩</b>"
SATURDAY = "<b>🟩🟩🟩 Суббота 🟩🟩🟩</b>"
SUNDAY = "<b>🟩🟩🟩 Воскресенье 🟩🟩🟩</b>"

CHOOSE_SETTINGS = "Что хочешь сделать?"
CHOOSE_NOTIFICATION_DELAY = "Выбери, за какое время до начала пары ты хочешь получать уведомление\n\n"\
                            "⚠️ <i>Все еще находится в разработке, поэтому может быть неточность "\
                            "по времени до 1 минуты</i>"
DATA_UPDATED_SUCCESSFUL = "✅ Данные успешно обновлены!"

FEEDBACK = "🤖 Я заметил, что ты пользуешься мной уже некоторое время.\n\n"\
           "Пожалуйста, заполни небольшую анкету обратной связи. "\
           "Твое мнение очень важно для меня и моих создателей 🤗"
FEEDBACK_WITH_URL = "🤖 Я заметил, что ты пользуешься мной уже некоторое время.\n\n"\
                    "Пожалуйста, заполни небольшую анкету обратной связи. "\
                    "Твое мнение очень важно для меня и моих создателей 🤗\n\n"\
                    "https://forms.gle/cSMLUNV8CPjhkGqX7"
FEEDBACK_LATER = "🤖 Ок, я еще вернусь"

CHOOSE_SCHEDULE_TYPE_OR_JOIN_TO_GROUP = "Выбери вариант расписания или вступи в группу, чтобы получать уведомления"