SOMETHING_WENT_WRONG = "🤖 Что-то пошло не так... Попробуйте позже"

START_COMMAND = "start"
START_ANSWER = "Привет 👋\n"\
        "Чтобы мы с тобой могли взаимодействовать друг с другом, тебе нужно выбрать свою роль ⤵"

CHOOSE_YOUR_ROLE_AGAIN = "Выбери свою роль еще раз ⤵"

STUDENT_SIGN_UP = "Давай знакомиться! Как тебя зовут? Напиши ФИО ✍️"
STUDENT_SIGNED_UP = "Теперь-то будем знакомы! 😊"
STUDENT_LOGGED_IN = "Рад снова видеть тебя здесь!"

SOMETHING_WITH_FULLNAME_VALIDATION = "Что-то не так с ФИО... Попробуй ввести еще раз"
STUDENT_IS_ALREADY_SIGNED_UP = "Мы ведь уже знакомились однажды 🤨"
STUDENT_NO_SIGNED_UP = "Я тебя не знаю 🫣\nВведи ФИО еще раз"

ADMIN_START = "Для начала работы Вам нужно создать аккаунт или войти в существующий ⤵"
ENTER_YOUR_EMAIL = "Введите свой email 📧"
INVENT_PASSWORD = "Придумайте сложный пароль (не менее 8 символов) 🔒"
ENTER_PASSWORD = "Введите пароль 🔒"
WRONG_PASSWORD = "Неверный пароль! Попробуйте ввести еще раз"

ADMIN_SIGNED_UP_SUCCESS = "Вы успешно зарегистрировались!"
ADMIN_LOGGED_IN_SUCCESS = "Вы вошли в систему!"
ADMIN_EMAIL_VALIDATION = "Неверный формат email. Попробуйте ввести его еще раз"
ADMIN_WITH_THIS_EMAIL_ALREADY_EXISTS = "Пользователь с таким email уже существует. Введите другой"
ADMIN_WITH_THIS_EMAIL_NO_EXISTS = "Пользователя с таким email не существует. Введите другой или зарегистрируйтесь"
ADMIN_PASSWORD_IS_SHORT = "Этот пароль слишком короткий, придумайте другой"

CHOOSE_FACULTY = "Выберите факультет"
CHOOSE_YOUR_FACULTY = "Выбери свой факультет"
CHOOSE_PROGRAM = 'Выберите программу обучения'
CHOOSE_YOUR_PROGRAM = "Выбери программу обучения"
ENTER_SHORT_GROUP_NAME = "Введите сокращенное название группы"
CHOOSE_YOUR_GROUP = "Выбери свою группу"
GROUP_WITH_THIS_SHORT_NAME_ALREADY_EXISTS = "Группа с таким названием уже была создана! Введите другое"

IN_DEVELOPING = "В разработке... 👨‍💻"

SOMETHING_WITH_MY_MEMORY = "Ой, что-то случилось с моей памятью 😵‍💫\n"\
                           "Давай начнем сначала"

GROUPS_WILL_BE_HERE_SOON = "Группы здесь скоро появятся..."
NOW_YOU_CAN_VIEW_SCHEDULE = "Теперь с помощью кнопок ниже ты можешь смотреть расписание "\
                                          "или вступить в группу"
YOU_JOINED_SUCCESSFUL = "Теперь ты участник группы! 🥳"
YOUR_GROUPS = "Вот группы, в которых ты состоишь:\n\n"
YOU_CAN_FIND_GROUP_AGAIN = "Ты можешь заново найти нужную тебе группу"
YOU_LEAVED_SUCCESSFUL = "Теперь ты не состоишь в этой группе 🫠"
YOU_ARE_ALREADY_JOINED = "Ты уже состоишь в этой группе!"

CHOOSE_SCHEDULE_TYPE = "Выбери вариант расписания ⤵"
SCHEDULE_NO_EXISTS = "Староста еще не загрузил расписание 😪\n"\
                     "Попробуй поторопить его"

NOW_FIRST_WEEK = "<b>I неделя</b>\n\n"
NOW_SECOND_WEEK = "<b>II неделя</b>\n\n"
TODAY_NO_SUBJECTS = "Сегодня пар нет 🥳"

MONDAY = "<b>🟩🟩🟩 Понедельник 🟩🟩🟩</b>"
TUESDAY = "<b>🟩🟩🟩 Вторник 🟩🟩🟩</b>"
WEDNESDAY = "<b>🟩🟩🟩 Среда 🟩🟩🟩</b>"
THURSDAY = "<b>🟩🟩🟩 Четверг 🟩🟩🟩</b>"
FRIDAY = "<b>🟩🟩🟩 Пятница 🟩🟩🟩</b>"
SATURDAY = "<b>🟩🟩🟩 Суббота 🟩🟩🟩</b>"
SUNDAY = "<b>🟩🟩🟩 Воскресенье 🟩🟩🟩</b>"

ENTER_NEW_FULL_NAME = "Введи новые ФИО ✍️"
CHOOSE_SETTINGS = "Выбери настройку"
CHOOSE_NOTIFICATION_DELAY = "Выбери, за какое время до начала пары ты хочешь получать уведомление"
DATA_UPDATED_SUCCESSFUL = "✅ Данные успешно обновлены!"

FEEDBACK = "🤖 Я заметил, что ты пользуешься мной уже несколько дней.\n\n"\
           "Пожалуйста, заполни небольшую анкету обратной связи. "\
           "Твое мнение очень важно для меня и моих создателей 🤗"
FEEDBACK_LATER = "🤖 Ок, я еще вернусь"